RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_dma.h
#include "cy_device.h"

#if defined (CY_IP_M4CPUSS_DMA) || defined (CY_IP_MXDW) || defined (CY_IP_M7CPUSS_DMA)

#include "cy_syslib.h"
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#if defined(__cplusplus)
extern "C" {
#endif

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 10.8', 15, \
'Value extracted from _VAL2FLD macro will not exceed enum range.');

/******************************************************************************
 * Macro definitions                                                          *
 ******************************************************************************/

/**
* \addtogroup group_dma_macros
* \{
*/

/** The driver major version */
#define CY_DMA_DRV_VERSION_MAJOR       2

/** The driver minor version */
#define CY_DMA_DRV_VERSION_MINOR       50

/** The DMA driver identifier */
#define CY_DMA_ID                      (CY_PDL_DRV_ID(0x13U))

/** The DMA channel interrupt mask */
#define CY_DMA_INTR_MASK               (0x01UL)

/** The minimum X/Y Count API parameters */
#define CY_DMA_LOOP_COUNT_MIN          (1UL)
/** The maximum X/Y Count API parameters */
#define CY_DMA_LOOP_COUNT_MAX          (256UL)

/** The minimum X/Y Increment API parameters */
#define CY_DMA_LOOP_INCREMENT_MIN      (-2048L)
/** The maximum X/Y Increment API parameters */
#define CY_DMA_LOOP_INCREMENT_MAX      (2047L)

/** The backward compatibility flag. Enables a group of macros which provide
* the backward compatibility with most of the DMA driver version 1.0 interface. */
#ifndef CY_DMA_BWC
    #define CY_DMA_BWC                 (0U) /* Disabled by default */
#endif

/** \} group_dma_macros */

/**
* \addtogroup group_dma_enums
* \{
*/

/** Contains the possible interrupt cause values */
typedef enum
{
    CY_DMA_INTR_CAUSE_NO_INTR            = 0U, /**< No interrupt.                       */
    CY_DMA_INTR_CAUSE_COMPLETION         = 1U, /**< Completion.                         */
    CY_DMA_INTR_CAUSE_SRC_BUS_ERROR      = 2U, /**< Source bus error.                   */
    CY_DMA_INTR_CAUSE_DST_BUS_ERROR      = 3U, /**< Destination bus error.              */
    CY_DMA_INTR_CAUSE_SRC_MISAL          = 4U, /**< Source address is not aligned.       */
    CY_DMA_INTR_CAUSE_DST_MISAL          = 5U, /**< Destination address is not aligned. */
    CY_DMA_INTR_CAUSE_CURR_PTR_NULL      = 6U, /**< Current descriptor pointer is NULL. */
    CY_DMA_INTR_CAUSE_ACTIVE_CH_DISABLED = 7U, /**< Active channel is disabled.         */
    CY_DMA_INTR_CAUSE_DESCR_BUS_ERROR    = 8U  /**< Descriptor bus error.               */
} cy_en_dma_intr_cause_t;

/** Contains the options for the descriptor type */
typedef enum
{
    CY_DMA_SINGLE_TRANSFER = 0UL,          /**< Single transfer. */
    CY_DMA_1D_TRANSFER     = 1UL,          /**< 1D transfer.     */
    CY_DMA_2D_TRANSFER     = 2UL,          /**< 2D transfer.     */
    CY_DMA_CRC_TRANSFER    = 3UL,          /**< CRC transfer. Supported by the CPUSS_ver2 only. */
} cy_en_dma_descriptor_type_t;

/** Contains the options for the interrupt, trig-in and trig-out type parameters of the descriptor */
typedef enum
{
    CY_DMA_1ELEMENT    = 0UL,              /**< One element transfer.             */
    CY_DMA_X_LOOP      = 1UL,              /**< One X loop transfer.              */
    CY_DMA_DESCR       = 2UL,              /**< One descriptor transfer.          */
    CY_DMA_DESCR_CHAIN = 3UL               /**< Entire descriptor chain transfer. */
} cy_en_dma_trigger_type_t;

/** Contains the options for the data size */
typedef enum
{
    CY_DMA_BYTE     = 0UL,                 /**< One byte.               */
    CY_DMA_HALFWORD = 1UL,                 /**< Half word (two bytes).  */
    CY_DMA_WORD     = 2UL                  /**< Full word (four bytes). */
} cy_en_dma_data_size_t;

/** Contains the options for descriptor retriggering */
typedef enum
{
    CY_DMA_RETRIG_IM      = 0UL,           /**< Retrigger immediately.              */
    CY_DMA_RETRIG_4CYC    = 1UL,           /**< Retrigger after 4 Clk_Slow cycles.  */
    CY_DMA_RETRIG_16CYC   = 2UL,           /**< Retrigger after 16 Clk_Slow cycles. */
    CY_DMA_WAIT_FOR_REACT = 3UL            /**< Wait for trigger reactivation.      */
} cy_en_dma_retrigger_t;

/** Contains the options for the transfer size */
typedef enum
{
    CY_DMA_TRANSFER_SIZE_DATA = 0UL,       /**< As specified by dataSize. */
    CY_DMA_TRANSFER_SIZE_WORD = 1UL,       /**< A full word (four bytes). */
} cy_en_dma_transfer_size_t;

/** Contains the options for the state of the channel when the descriptor is completed   */
typedef enum
{
    CY_DMA_CHANNEL_ENABLED  = 0UL,         /**< Channel stays enabled. */
    CY_DMA_CHANNEL_DISABLED = 1UL          /**< Channel is disabled.   */
} cy_en_dma_channel_state_t;

/** Contains the return values of the DMA driver */
typedef enum
{
    CY_DMA_SUCCESS   = 0x00UL, /**< Success. */
    CY_DMA_BAD_PARAM = CY_DMA_ID | CY_PDL_STATUS_ERROR | 0x01UL /**< The input parameters passed to the DMA API are not valid. */
} cy_en_dma_status_t;

/** \} group_dma_enums */


/** \cond Internal */

/* Macros for the conditions used by CY_ASSERT calls */
#define CY_DMA_IS_LOOP_COUNT_VALID(count)      (((count) >= CY_DMA_LOOP_COUNT_MIN) && ((count) <= CY_DMA_LOOP_COUNT_MAX))
#define CY_DMA_IS_LOOP_INCR_VALID(incr)        (((incr) >= CY_DMA_LOOP_INCREMENT_MIN) && ((incr) <= CY_DMA_LOOP_INCREMENT_MAX))
#define CY_DMA_IS_PRIORITY_VALID(prio)         ((prio) <= 3UL)
#define CY_DMA_IS_INTR_MASK_VALID(intr)        (0UL == ((intr) & ((uint32_t) ~CY_DMA_INTR_MASK)))

#define CY_DMA_IS_RETRIG_VALID(retrig)         ((CY_DMA_RETRIG_IM      == (retrig)) || \
                                                (CY_DMA_RETRIG_4CYC    == (retrig)) || \
                                                (CY_DMA_RETRIG_16CYC   == (retrig)) || \
                                                (CY_DMA_WAIT_FOR_REACT == (retrig)))

#define CY_DMA_IS_TRIG_TYPE_VALID(trigType)    ((CY_DMA_1ELEMENT    == (trigType)) || \
                                                (CY_DMA_X_LOOP      == (trigType)) || \
                                                (CY_DMA_DESCR       == (trigType)) || \
                                                (CY_DMA_DESCR_CHAIN == (trigType)))

#define CY_DMA_IS_XFER_SIZE_VALID(xferSize)    ((CY_DMA_TRANSFER_SIZE_DATA == (xferSize)) || \
                                                (CY_DMA_TRANSFER_SIZE_WORD == (xferSize)))

